Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཤེས་བྱ་བར་དམིགས་པ་ལ་སྤྱོད་སྤྱོད་པ་ཡིན་གྱིས། དེ་ལ་བདག་གིས་ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་དམིགས་པའི་ཉེས་པ་དེ་དག་མེད་པར་བྱའོ་སྙམ་སྟེ།
en: Therefore, on their behalf, when by whatever means I have attained consummate buddhahood in unsurpassed, complete enlightenment, I will ensure that the faults in the apprehending of beings are eliminated!’ “

source: དེ་སེམས་བསྐྱེད་པ་དེ་ལྟ་བུ་དག་དང་ལྡན་ལ་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་མ་རྫོགས་པར་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་དེ།
en: Those who have set their minds on enlightenment in that manner and who practice the perfection of wisdom, endowed with skill in means, do not actualize the very limit of reality until they have perfected the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: At that time, bodhisattva great beings will perfect the cultivation of the meditative stabilities of emptiness, signlessness, and wishlessness. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་མཚན་མ་ལ་སྤྱོད་སྤྱོད་པ་སྟེ། བུད་མེད་ཀྱི་མཚན་མ་འམ། སྐྱེས་པའི་མཚན་མ་འམ། གཟུགས་ཀྱི་མཚན་མ་འམ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they think, ‘For a long period of time these beings have engaged with signs, that is to say, they have engaged with signs denoting the female gender; signs denoting the male gender; signs denoting physical forms; {Ki.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མཚན་མ་འམ། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་མཚན་མ་འམ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་མའམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་གྱི་མཚན་མ་འམ།
en: IV: 199} signs denoting feelings, perceptions, formative predispositions, and consciousness; signs denoting the sense fields, sensory elements and links of dependent origination; signs denoting the perfections, the aspects of emptiness, and the factors conducive to enlightenment; signs denoting [the fruitional attributes], up to and including the distinct qualities of the buddhas; and signs denoting [the goals], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་མཚན་མ་ལ་སྤྱོད་སྤྱོད་པ་ཡིན་གྱིས། དེ་ལ་བདག་གིས་ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་དེ་དག་མེད་པར་བྱའོ་སྙམ་སྟེ། དེ་སེམས་བསྐྱེད་པ་དེ་ལྟ་བུ་དང་ལྡན་ལ།
en: Therefore, on their behalf, when by whatever means I have attained consummate buddhahood in unsurpassed, complete enlightenment, I will ensure that these faults of beings are eliminated!’

source: ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་མ་རྫོགས་པར་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་དེ།
en: Those who have set their minds on enlightenment in that manner and practice the perfection of wisdom with skill in means will not actualize the very limit of reality until they have perfected the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: At that time, bodhisattva great beings will perfect the cultivation of the meditative stabilities of emptiness, signlessness, and wishlessness. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་སྨོན་ལམ་ལ་སྤྱོད་སྤྱོད་པ་སྟེ། འདི་ལྟར་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they think, ‘For a long period of time these beings have engaged with aspirations, that is to say, they have aspired to the status of Śakra, the status of Brahmā, the status of a guardian of the world, or the status of a universal monarch.

source: འཁོར་ལོས་སྒྱུར་བ་ལ་མངོན་པར་དགའོ། །གཟུགས་ལ་མངོན་པར་དགའོ།
en: They have aspired to physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མངོན་པར་དགའོ།
en: They have aspired to feelings, perceptions, formative predispositions, and consciousness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མངོན་པར་དགའོ།
en: They have aspired to [all the causal and fruitional attributes and goals], up to and including all-aspect omniscience.

source: །དེ་ལྟ་བས་ན་དེ་དག་གི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Therefore, on their behalf, I will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: ཅི་ནས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་སྨོན་ལམ་གྱི་ཉེས་པ་དེ་དག་མེད་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་བསྟན་པར་བྱའོ་སྙམ་སྟེ།
en: I will teach the Dharma so that by whatever means I will ensure that these faults of the aspirations of beings are eliminated!’

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་བསྐྱེད་པ་དེ་དག་དང་ལྡན་ལ། ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: Subhūti, bodhisattva great beings who have set their minds on enlightenment in that manner and practice the perfection of wisdom with skill in means will perfect the cultivation of the meditative stabilities of emptiness, signlessness, and wishlessness—the gateways of liberation.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་མ་རྫོགས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་དོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྤྱོད་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: They will not actualize the very limit of reality until they have perfected the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion, and so on, until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་སྤྱོད་པ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: It is impossible and there is no chance, Subhūti, that bodhisattva great beings who practice the six perfections; who practice the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; who practice the applications of mindfulness; who practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; who practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; who practice the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and who practice the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas—and who investigate them, endowed with the vision of such wisdom—will lapse into that which should not be actualized, or become associated with the three realms. {

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་དང་། འདྲིས་པར་བྱེད་ཅིང་དེ་ལྟ་བུའི་ཡེ་ཤེས་མཐོང་བ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མངོན་པར་འདུ་བྱ་བ་མེད་པར་ལྟུང་བ་འམ། ཁམས་གསུམ་པ་དང་ལྷན་ཅིག་གནས་པའི་གནས་མེད་སྐབས་མེད་དེ་དེ་ནི་གནས་མ་ཡིན་ནོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྤྱོད་ཅིང་།
en: Ki.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་འདི་དག་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་པ་དེ་དག་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཆོས་འདི་དག་ལ་སྤྱད་དེ་ཡོངས་སུ་འདྲིས་པར་བྱས་ནས། སྟོང་པ་ཉིད་དང་ཡང་དག་པའི་མཐའ་གང་རྟོགས་པས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་འཐོབ་པར་འགྱུར་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་བའི་སྟོང་པ་ཉིད་མངོན་དུ་མི་བྱེད་ཅིང་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་པ་ཡིན། ཇི་ལྟར་ན་མཚན་མ་མེད་པ་དང་།
en: IV: 200} “It should be asked of bodhisattva great beings who practice accordingly and investigate these factors conducive to enlightenment, ‘How do bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment investigate these [fruitional] attributes, but not actualize emptiness and not actualize the very limit of reality through the realization of which the fruit of entering the stream to nirvāṇa is attained, and through which the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment are attained?

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། དངོས་པོ་མེད་པ་མངོན་པར་འདུ་མི་བྱེད་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་བསྒོམ་པ་ཡིན་ཞེས་དྲི་བར་བྱའོ།
en: How do they not actualize signlessness, wishlessness, nonconditioning, nonarising, and nonentity, but do indeed cultivate the perfection of wisdom?’ “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་གིས་དེ་སྐད་དུ་དྲིས་ན་དེ་ལ་ལན་ལྡོན་ཞིང་དེས་སྟོང་པ་ཉིད་ཡིད་ལ་བྱའོ། །དེས་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། དངོས་པོ་མེད་པ་ཡིད་ལ་བྱའོ་ཞེས་ཟེར་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ།
en: Subhūti, when bodhisattva great beings who practice the perfection of wisdom are questioned by other bodhisattva great beings in that manner, if they respond, saying that they should focus their attention on emptiness, and they should focus their attention on signlessness, wishlessness, nonconditioning, nonarising, noncessation, and nonentity, then, Subhūti, those [other] bodhisattva great beings should know that these bodhisattva great beings have been prophesied by the lord buddhas to attain unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་འདྲིས་པར་བྱ་བ་དེ་བརྗོད་དོ། །དེ་ལུང་བསྟན་ཏོ། །དེ་རབ་ཏུ་འབྱེད་དོ།
en: If you ask why, it is because they declare, predict, and distinguish the investigation that irreversible bodhisattva great beings should achieve. “

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་དེ་སྐད་དུ་དྲིས་ན། འདི་སྐད་དུ་སྟོན་ཅིང་། དེས་སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་མི་བྱའོ། །དེས་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། དངོས་པོ་མེད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་མི་བྱའོ། །དེས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཡོངས་སུ་འདྲིས་པར་མི་བྱའོ་ཞེས་ཟེར་ན།
en: Subhūti, when bodhisattva great beings are questioned in that manner, if they respond, saying that they should not investigate emptiness, that they should not investigate signlessness, wishlessness, nonconditioning, nonarising, noncessation, and nonentity, and that they should not investigate the factors conducive to enlightenment, then, Subhūti, those [other] bodhisattva great beings should know that these bodhisattva great beings have not been prophesied by the lord buddhas to attain unsurpassed, complete enlightenment.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་འདྲིས་པར་བྱ་བ་དེ་མི་རྗོད་ཅིང་ལུང་མི་སྟོན་ལ་རབ་ཏུ་མི་འབྱེད་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because they do not declare, do not predict, and do not distinguish the investigation that irreversible bodhisattva great beings should achieve. “

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་གང་ཡིན་པ་དེ་ནི་མི་རྗོད་པ་དང་། ལུང་མི་སྟོན་པ་དང་། རབ་ཏུ་མི་འབྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་ཡོངས་སུ་འདྲིས་པར་བྱས་ནས། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཕྱིར་མི་ལྡོག་པའི་ས་ནོན་པ་ལྟར་སྲབས་པའི་ས་ནོན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ།
en: With regard to those bodhisattva great beings who do not declare, do not predict, and do not distinguish the [fruitional] attributes of irreversible bodhisattva great beings, [other] bodhisattva great beings should know that they will not transcend the level of the attenuated refinement [of the śrāvakas], in the manner in which irreversible bodhisattva great beings have investigated and transcended the level at which progress has become irreversible.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གང་གིས་སླར་མི་ལྡོག་པར་འགྱུར་བའི་རྣམ་གྲངས་དེ་ལྟ་བུ་མཆིས་སམ།
en: Blessed Lord, is there a reason why bodhisattvas may be styled ‘irreversible’?” {

source: རབ་འབྱོར་དེ་ནི་ཡོད་དོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཐོས་ཀྱང་རུང་། མ་ཐོས་ཀྱང་རུང་སྟེ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟ་བ་བཞིན་དུ་ལན་གློན་པའོ།
en: Subhūti, whether or not bodhisattva great beings have studied the six perfections, irreversible bodhisattvas will respond precisely in the manner of an irreversible bodhisattva great being.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་ནི་མང་སྟེ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་སྦྱང་བའི་ས་འམ། ཡོངས་སུ་སྦྱང་བ་མ་ལགས་པའི་ས་ལ་གནས་པ་བཞིན་དུ་ལན་འདེབས་པ་ནི་ཉུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, for that reason there are many who are engaged in [the pursuit of] enlightenment, but there are few who could respond in the manner of an irreversible bodhisattva great being, whether they dwell on the purificatory levels or the nonpurificatory levels.” “

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཕྱིར་མི་ལྡོག་པའི་ཡེ་ཤེས་ཀྱི་སར་ལུང་བསྟན་པ་དེ་དག་ནི་ཉུང་སྟེ།
en: If you ask why, Subhūti, bodhisattva great beings of whom the level of irreversible wisdom has been prophesied are few in number.

source: གང་ལུང་བསྟན་པ་དེ་དག་ནི་རྣམ་པ་དེ་བཞིན་དུ་ལན་གློན་ཏེ།
en: Those who have been prophesied will respond correctly.

source: གང་རྣམ་པ་དེ་ལྟར་ལན་གློན་པ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་རིག་པར་བྱའོ།
en: One should know that those who respond correctly have cultivated the roots of virtuous action.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དང་དེ་དག་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་མི་འཕྲོགས་པ་ཡིན་ནོ།
en: Subhūti, those bodhisattva great beings will not be captivated by the whole world, with its gods, humans, and asuras.”

source: ལེའུ་བཞི་བཅུ་རྩ་བཞི་པའོ།། །།དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Chapter 45 {Ki.

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྨི་ལམ་ན་ཡང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་འམ། ཁམས་གསུམ་པ་ལ་འདོད་སེམས་མི་སྐྱེད། ལེགས་པའི་སེམས་མི་སྐྱེད་ཅིང་། ཆོས་ཐམས་ཅད་རྨི་ལམ་དང་འདྲ་བ་ཉིད་དུ་ལྟ། སྒྲ་བརྙན་དང་འདྲ་བ་དང་། གཟུགས་བརྙན་དང་འདྲ་བ་དང་། སྨིག་རྒྱུ་དང་འདྲ་བ་དང་། སྤྲུལ་པ་དང་འདྲ་བ་ཉིད་དུ་ལྟ་ལ་མངོན་དུ་མི་བྱེད་ན།
en: V: 1} Then the Blessed One said to the venerable Subhūti, “Subhūti, if bodhisattva great beings, even in their dreams, do not have thoughts of longing for the level of the śrāvakas or the level of the pratyekabuddhas, and do not think that these [levels] are advantageous—and if they do not actualize anything, regarding all phenomena as like a dream, and regarding them like an echo, a reflection, a mirage, and a phantom—these, Subhūti, should be known as the irreversible defining characteristics of an irreversible bodhisattva. “

source: རབ་འབྱོར་འདི་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་ན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞབས་འབྲིང་བརྒྱ་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་སྟོང་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་བྱེ་བ་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་བྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་བྱེ་བ་སྟོང་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། ཞབས་འབྲིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་མངའ་བ། དགེ་སློང་དང་དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མང་པོས་ཀུན་ནས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ་ཆོས་སྟོན་པ་མཐོང་ལ། དེས་ཆོས་དེ་ཐོས་ནས། ཆོས་དེའི་དོན་ཤེས་པར་བྱའོ་ཞེས་ཆོས་དང་། གཉེར་བའི་ཆོས་ལ་ཞུགས་ཤིང་གནས་པ་དང་། འཐུན་པར་ཞུགས་ཏེ་གཉེར་བའི་ཆོས་ལ་སྤྱོད་པ་མཐོང་ན། རབ་འབྱོར་འདི་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ།
en: Moreover, Subhūti, if bodhisattva great beings, even in their dreams, see the tathāgata, arhat, completely awakened Buddha teaching the Dharma with an entourage of many hundreds, an entourage of many thousands, an entourage of many hundred thousands, an entourage of many ten millions, an entourage of many billions, an entourage of many ten billions, an entourage of many trillions, or an entourage of many hundred billion trillions, and surrounded and revered by many monks, nuns, laymen, laywomen, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas—and if, having listened to that Dharma, they are seen entering into and abiding in accordance with the Dharma, the meaning of which is to be known, and the attributes of which are to be tended, or entering into it at an appropriate time and engaging with its attributes that are to be tended—these, Subhūti, should also be known as the irreversible defining characteristics of an irreversible bodhisattva. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་ན་ཡང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་མཁའ་ལ་འཕགས་ཤིང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ཆོས་སྟོན་པ་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ། འོད་འདོམ་གང་བ་མངའ་བ། རྫུ་འཕྲུལ་དང་ཆོ་འཕྲུལ་མང་པོ་སྟོན་པ།
en: Moreover, Subhūti, if bodhisattva great beings, even in their dreams, see the tathāgata, arhat, completely awakened Buddha, elevated in the air and teaching the Dharma to a community of monks, endowed with the thirty-two major marks of a great person, with an aureole of light extending a full arm span, demonstrating many miraculous abilities and powers, conjuring many emanations, and performing through those very emanations the deeds of the buddhas in other world systems, these, Subhūti, should also be known as the irreversible defining characteristics of an irreversible bodhisattva. {

source: སྤྲུལ་པ་མང་པོ་སྤྲུལ་པ་མཛད་ཅིང་། སྤྲུལ་པ་དེ་དག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པ་མཐོང་ན། རབ་འབྱོར་འདི་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ།
en: Ki.

source: །རབ་འབྱོར་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་ན་ཡང་གྲོང་བཅོམ་པ་འམ། གྲོང་ཁྱེར་བཅོམ་པ་འམ། མེ་ཐར་པ་འམ། གཅན་ཟན་ཁྲོ་བོ་མཐོང་ངམ། དེ་མ་ཡིན་པའི་གཅན་ཟན་གཏུམ་པོའི་རྣམ་པ་མཐོང་ངམ། མགོ་བཅད་པར་གྱུར་པ་མཐོང་ངམ། དེ་མ་ཡིན་པའི་འཇིགས་ཤིང་མི་བཟད་པ་དང་སྔང་བར་འགྱུར་བ་མཐོང་ངམ། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་མཐོང་ངམ། བཀྲེས་པ་དང་། སྐོམ་པ་མཐོང་ངམ། ཕ་ཤི་བ་འམ། མ་ཤི་བ་འམ། ཕུ་ནུ་ཤི་བ་འམ། བུ་སྲིང་ཤི་བ་འམ། གྲོགས་པོ་འམ། གཉེན་བཤེས་ཤི་བ་མཐོང་ན། མྱ་ངན་དང་འཇིགས་ཤིང་མི་བཟད་པ་དང་།
en: V: 2} “Moreover, Subhūti, when bodhisattva great beings, even in their dreams, see the destruction of a town, the destruction of a city, a conflagration, or ferocious wild animals; or see their head being cut off; or, apart from that, see terrifying, unbearable, and frightening phenomena; or see suffering, discomfort, and agitation; or see those who are hungry and thirsty; or see the death of their father, the death of their mother, the death of their brother, the death of their sister, the death of their friend, or the death of their relative, if they do not grieve, are not terrified, and do not fear, and on awakening from that dream if they think, ‘Alas!

source: སྔང་བར་མི་འགྱུར་ལ། རྨི་ལམ་དེ་རྨིས་པའི་འོག་ཏུ་སད་ནས་ཀྱང་འདི་སྙམ་སྟེ། ཀྱེ་མ་ཁམས་གསུམ་པ་འདི་དག་ཀུན་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྟེ།
en: These three realms are all like a dream.

source: བདག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཁམས་གསུམ་པའི་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་བསྟན་པར་བྱའོ་སྙམ་ན། རབ་འབྱོར་འདི་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ།
en: Once I have attained consummate buddhahood in unsurpassed, complete enlightenment, I will teach that all the phenomena of the three realms are like a dream,’ then, Subhūti, this, too, should be known as the irreversible defining characteristic of an irreversible bodhisattva. “

source: །རབ་འབྱོར་གཞན་ཡང་ཇི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ངན་སོང་གསུམ་པོ་ཐམས་ཅད་དུ་ཐམས་ཅད། རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་བར་རིག་པར་བྱ་ཞེ་ན།
en: Moreover, Subhūti, you may ask how one should know that, when irreversible bodhisattva great beings have attained consummate buddhahood in unsurpassed, complete enlightenment, in that buddhafield the three lower realms in their entirety will be completely nonexistent in all respects.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྨི་ལམ་དུ་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་མཐོང་ངམ། བྱོལ་སོང་གི་སྐྱེ་གནས་པའི་སེམས་ཅན་ནམ། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་མཐོང་ན། འདི་ལྟ་བུའི་དྲན་པ་འཐོབ་ཅིང་དྲན་པ་ཐོབ་ནས་ཀྱང་འདི་སྙམ་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ངན་སོང་གསུམ་པོ་ཐམས་ཅད་དུ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་བ་དེ་ལྟར་སྤྱོད་དོ།
en: When bodhisattva great beings see in their dreams beings who are denizens of the hells, or see beings of the animal realm, or beings of the world of Yama, if they then recollect such things and after recollecting them think, ‘Once I have attained consummate buddhahood in unsurpassed, complete enlightenment, I will act in such a way that in that buddhafield the three lower realms in their entirety will be completely nonexistent in all respects.

source: དེ་ནི་འདི་ལྟར་རྨི་ལམ་གང་ཡིན་པ་དང་། རྨི་ལམ་གྱི་མཐའ་གང་ཡིན་པ་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ་སྙམ་ན།
en: Because the dreaming and waking states are not two.
